{
    "essential_identity": {
      "name": "Cap Yamanaka",
      "clan": "Yamanaka (Hidden Leaf Village)",
      "titles": [
        "The Mind’s Beacon – for his ability to guide and support allies through mental clarity",
        "Monarch of Stillness – for his mastery of controlling battle momentum through illusions"
      ],
      "affiliation": "Konohagakure",
      "status": "Elite Leaf Shinobi; Specialist in Diplomatic Ops & Psychological Warfare, Owl Sage",
      "age": "Early to mid-thirties",
      "height": "~5’11”",
      "notable_traits": [
        "Methodical and calm under pressure",
        "Deep sense of empathy balanced by keen strategic thinking",
        "Specializes in subtle infiltration and crowd-disruption techniques"
      ]
    },
    "appearance_and_demeanor": {
      "general_look": {
        "attire": "Polished, well-fitted shinobi uniform with subtle Yamanaka flourishes",
        "hair": "Pale blond, neatly tied back",
        "eyes": "Pale green, calm and observant",
        "posture": "Perfect posture reflecting discipline"
      },
      "demeanor": {
        "speech": "Speaks clearly and softly, rarely raising his voice",
        "movement": "Efficient in combat with no wasted action",
        "presence": "Reassuring yet vigilant"
      }
    },
    "backstory": {
      "clan_upbringing": "Raised within the Yamanaka clan compound; learned empathy-based teachings and symbolism from a young age; showed early talent for mind-related jutsu, particularly telepathy and subtle illusions.",
      "early_catalyst": "As a boy, accompanied senior Yamanaka on a mission that turned dire and instinctively used a half-formed mind-control technique to pacify aggressors, collapsing afterward as he realized raw power requires careful control.",
      "climbing_the_ranks": "Distinguished himself in the Chūnin Exams with infiltration feats and mental illusions; excelled in negotiations, hostage rescues, and intelligence-gathering, building a reputation for 'problem containment before it erupts.'",
      "advanced_development": "Nearly lost comrades to a dangerous rogue squad; under emotional strain, unleashed an advanced mental technique (later refined into 'Synaptic Overdrive') that drove him to master high-level illusions without overtaxing his psyche."
    },
    "psychological_and_moral_profile": {
      "empathy_and_restraint": "Extremely empathic, preferring to subdue or reason with foes if possible, yet understanding that lethal force is sometimes unavoidable.",
      "structured_approach": "Plans meticulously, carrying multiple contingencies; uses telepathic links and illusions to glean truth before forming judgments.",
      "stress_management": "Relies on prayer, meditation, or short mental exercises to maintain focus; rarely shows panic, though may become terse if situations spiral.",
      "team_player": "Highly compatible in squad missions; capable of linking minds telepathically to feed illusions or provide real-time intel; synergy with sensor- or trap-setting allies multiplies his effectiveness."
    },
    "combat_philosophy": {
      "quote": "A scattered mind loses before it begins.",
      "mental_over_physical": "Excels in illusions, infiltration, and telepathic disruption, minimizing direct brawling unless necessary, and using precise strikes or illusions to avoid stalemates.",
      "contain_and_subdue": "Aims to disarm or mentally disable foes to prevent bloodshed; jutsu revolve around sowing confusion, fear, or disorientation.",
      "layered_escalation": "Maintains multiple 'states' or 'forms' that gradually increase in power; saves his most advanced illusions for high-threat scenarios and only uses large-scale rewrites when absolutely necessary."
    },
    "standard_loadout_and_equipment": {
      "attire": "Standard Leaf ak jacket or lightly armored stealth garb",
      "weapon": "Short Wakizashi for quick self-defense or to channel illusions via blade seals",
      "special_equipment": "Special Sealing Tags, inscribed personally to anchor illusions or restrain an opponent’s mind-based jutsu",
      "communication": "Occasionally uses earpieces; telepathy reduces reliance on external communication gear"
    },
    "primary_ninjutsu_and_proficiencies": {
      "yamanaka_clan_techniques": {
        "mind_body_switch": "A variation of Shintenshin that leaves a portion of his consciousness behind as an 'anchor' so his body remains protected",
        "mind_clone_switch": "Briefly splits his consciousness to control multiple targets in quick bursts",
        "mind_disturbance": "Overwrites an enemy’s senses or impulses, causing unpredictable actions"
      },
      "telepathic_communication": "Maintains a refined long-range link for silent guidance of allies and orchestration of ambushes; senses emotional fluctuations to detect hidden foes",
      "illusion_crafting": {
        "reflexive_genjutsu": "Attacks attempting to probe his mind are ensnared by illusions reflecting their own subconscious fears",
        "reality_overwrite": "Layers illusions so convincingly that foes yield before direct combat ensues"
      },
      "elemental_affinities": {
        "wind_release": "Creates gusts to spread illusions or disrupt enemy formations",
        "water_release": "Creates mists or slick terrain to enhance stealth advantages"
      }
    },
    "summoning_contract": {
      "contract_name": "Owls of Yugure Hollow",
      "description": "A unique pact that grants him a tactical edge in silent infiltration and wide-range illusions",
      "owl_allies": {
        "aurora": "Snowy Owl: Specialized in reconnaissance with illusions that blend with swirling, snow-like feathers",
        "daedalus": "Great Horned Owl: Larger, capable of a sonic screech that disorients multiple foes, also physically imposing if forced into direct engagement",
        "elder_lucidus": "Ancient owl; rarely summoned but crucial for advanced sage transformations"
      }
    },
    "combat_form_progression": {
      "forms": [
        {
          "name": "Base (No Transformation)",
          "description": "Relies on core Yamanaka techniques, illusions, and telepathy; ideal for standard missions or single-adversary conflicts with low chakra drain and minimal risk."
        },
        {
          "name": "Mind-Shroud Activation",
          "description": "Cloaks Cap in a thin aura of mental chakra that distorts enemy perception; increases stealth and deepens the impact of illusions, ideal for mid-tier squad takedowns."
        },
        {
          "name": "Synaptic Overdrive",
          "description": "Accelerates mental processing to perceive threats in slow motion, enabling rapid, layered illusions or mind-switch attempts; high impact but mentally draining if overused."
        },
        {
          "name": "Owl Sage Mode",
          "description": "Grants owl-like markings and heightened senses; illusions are enhanced by 'feather illusions' that swirl around targets, enabling exceptional nocturnal vision and chakra reading."
        },
        {
          "name": "Celestial Mind Avatar (Partial)",
          "description": "Summons a semi-translucent, owl-themed astral figure (~15–20 meters tall) that hampers enemy mental focus; excellent for controlling larger skirmishes."
        },
        {
          "name": "Celestial Mind Avatar (Full)",
          "description": "The owl avatar grows to envelop Cap in a luminous astral form (~25–30 meters tall), delivering wide-scale illusions that can incapacitate entire platoons; consumes significant chakra."
        },
        {
          "name": "Hybrid Variations",
          "description": "Combinations such as Synaptic Overdrive with Partial Avatar or Owl Sage Mode with Partial Avatar for overwhelming mid-sized enemy forces; used sparingly due to heavy chakra taxation."
        }
      ]
    },
    "signature_techniques": {
      "resonant_silence": "A telepathic genjutsu that mutes all sound and disrupts enemy communication over a wide radius.",
      "mind_forged_lockdown": "Combines mind-binding with sealing scripts to trap a target's consciousness in a layered labyrinth until they break free.",
      "featherfall_haze": "Utilizes owl sage-powered illusions to create drifting feathers that cause disorientation and near-trance states.",
      "synapse_shatter": "Fires a pinpoint pulse of psychic energy designed to knock out or heavily daze a target, subject to their mental fortitude.",
      "storm_of_whispers": "Emits a broad wave of mental static causing enemies to hear conflicting orders or haunting whispers, breaking enemy formations.",
      "reverie_of_the_moonlit_owl": "A finishing illusion in Owl Sage Mode that conjures a dreamlike, moonlit forest in the opponent’s mind, leaving them dazed as they wander the illusory realm."
    },
    "summoning_examples": {
      "aurora": "Snowy Owl: Specializes in reconnaissance and stealth illusions, nearly invisible at night, capable of dropping small tags or bombs.",
      "daedalus": "Great Horned Owl: Larger and physically imposing, uses a sonic screech to disorient multiple foes and disrupt weak structures.",
      "elder_lucidus": "Ancient owl: Rarely summoned, but crucial for unlocking or stabilizing advanced Owl Sage transformations in critical situations."
    },
    "combat_behavior_and_tactics": {
      "infiltrate_and_observe": "Prefers to observe and gather information telepathically before engaging; sets up illusions or mental triggers based on enemy behavior.",
      "coordinated_strikes": "Uses telepathy to coordinate attacks with allies, ensuring minimal friendly fire while deploying morale-breaking illusions.",
      "adaptive_escalation": "Transitions from Base to Mind-Shroud to Synaptic Overdrive (or directly to Owl Sage Mode) as the threat escalates; may summon allies to maintain coverage.",
      "protection_of_allies": "Avoids deploying illusions that might inadvertently harm teammates; maintains clear mental focus to ensure controlled use of large-scale illusions."
    },
    "quotes_and_personality_cues": {
      "sample_quotes": [
        "Your blade can break my defenses. Your will, however, is more fragile than you think.",
        "I prefer an end to bloodshed... yet I’ll do what I must to stop you.",
        "In the hush of your thoughts, you’ll find the illusions I’ve left behind."
      ],
      "notes": "These lines reflect his calm, resolute mindset in both negotiation and combat."
    },
    "potential_weaknesses_and_limitations": {
      "mental_strain": "Large-scale illusions or rapid mind-switching can quickly drain his mental energy, risking severe headaches or temporary confusion.",
      "unusual_targets": "Opponents with radically alien minds or bizarre constructs may resist his standard illusions.",
      "close_quarters": "While capable with a blade, his strength lies in mental tactics; swift, aggressive close-combat fighters may force him into a defensive position.",
      "ethical_constraints": "Prefers nonlethal approaches; his reluctance to fully destroy foes may be exploited by relentless adversaries."
    },
    "reputation_and_relationships": {
      "hidden_leaf_village": "Highly valued for his ability to minimize bloodshed through mental pacification, though some remain wary of his mind-manipulation techniques.",
      "feudal_lords_and_daimyo": "Trusted for high-stakes negotiations; his illusions can reveal hidden intentions, making him a discreet problem-solver.",
      "allied_teams": "Works synergistically with sensor-type and infiltration partners, often anchoring telepathic links for entire squads during covert operations."
    },
    "sample_scenario": {
      "battle_demonstration": [
        "Cap arrives quietly on the battlefield, reading the emotions of an enemy platoon.",
        "Activates Mind-Shroud, blending into the enemy ranks while planting illusions of additional Leaf reinforcements.",
        "Unleashes Storm of Whispers, spreading confusion among the enemy, causing them to hesitate and debate their orders.",
        "Engages Synapse Overdrive, tagging commanding officers with Mind-Forged Lockdown seals.",
        "Summons Daedalus with a thunderous screech that further disorients the enemy.",
        "With the leadership neutralized, the remaining enemy forces panic or surrender, and Cap ends hostilities with minimal casualties."
      ]
    },
    "epilogue_and_theme": {
      "theme": "Cap Yamanaka embodies the pinnacle of refined mental warfare. His mastery of illusions and telepathy balances moral restraint with formidable strategic skill.",
      "summary": "Cap’s disciplined mind and tactical acumen allow him to tip the scales of any conflict, proving that the sharpest weapon is often the mind itself.",
      "final_notes": "His approach is measured, leveraging subtle yet powerful techniques to dismantle enemy formations without unnecessary violence."
    },
    "simulation_commands": [
      {
        "command": "Run Chakra Integrity Check",
        "description": "Recalculate and report each combatant's chakra from initialization to the current stage."
      },
      {
        "command": "Show Simulation Layer for Stage X",
        "description": "Display raw simulation data for a given stage without narrative enhancements."
      },
      {
        "command": "Verify Technique Legality [Technique Name]",
        "description": "Confirm that a particular technique is supported by the combatant’s profile."
      },
      {
        "command": "Pause Narration, Sim Only",
        "description": "Switch to a mechanical-only reporting mode with no anime-style output."
      },
      {
        "command": "Resume Dual-Layer Mode",
        "description": "Resume full simulation and narrative output under Dual-Layer Mode."
      },
      {
        "command": "Rollback to Stage X",
        "description": "Reset the simulation to a previous stage and recalculate all states and chakra reserves."
      },
      {
        "command": "Directive Breach – Reset Required",
        "description": "Immediately restart simulation tracking from Stage 0 with corrections."
      }
    ],
    "battle_start_confirmation": {
      "steps": [
        "Initialize chakra for each combatant based on type (100%, 165%, or 200%).",
        "Randomly select a battlefield and apply all environmental effects.",
        "Narrate the Opening Scene with dynamic visuals, intense character introductions, and dialogue that reflects each combatant’s persona.",
        "End the scene with the question: 'Do you wish to proceed to Stage 1?'"
      ]
    },
    "system_lock_extensions": {
      "auto_epilogue": "Auto-epilogue is enabled; no simulation may conclude without delivering an epilogue.",
      "narrative_output_lock": "Narrative output must reflect only the validated simulation layer without additional dramatic embellishments.",
      "post_victory_lock": "After defeat, the simulator must deliver a tactical breakdown and epilogue without further user prompts."
    },
    "dual_layer_simulation_mode": {
      "description": "The simulation operates in two layers: the internal simulation layer processes all mechanics, chakra tracking, and combat legality; the external narrative layer presents only the final validated simulation results with immersive, anime-style narration."
    }
  }
  