{
    "essential_identity": {
      "name": "Chen Yotsuki",
      "clan": "Yotsuki Clan",
      "village_of_origin": "Kumogakure no Sato (Hidden Cloud)",
      "current_residence": "Kumogakure",
      "rank": "Jōnin Commander / Head of the Yotsuki Clan",
      "primary_role": "Battlefield Control, Elite Tactician, Lightning Specialist",
      "titles": [
        "Sovereign Storm",
        "Azure Thunder Queen",
        "Judicator of the Storm Pact"
      ],
      "summoning_contract": "Raijin’s Beasts (Thunder Kirin, Thunder Hawks)",
      "guiding_principle": "Precision over Brutality — harness destructive force only when necessary"
    },
    "backstory": {
      "overview": "Born into the illustrious yet once-brutal Yotsuki bloodline, Chen inherited raw lightning power. Her life was irrevocably changed at age fourteen when betrayal within her clan cost her mother’s life. During that fateful thunderstorm, she awakened Storm Release and executed her conspirators with methodical precision. At eighteen, she endured the Trial of Raijin, standing unscathed in an endless storm for three days. Emerging with the mark of the Storm Deity, she reformed her clan’s ethos toward mastery and precision balanced by mercy."
    },
    "personality_and_philosophy": {
      "justice_through_control": "Believes the greatest strength lies in discipline; uses lightning to guide and, if necessary, obliterate those who prove irredeemably hostile.",
      "measured_judicator": "Calm and detached in conflict; each strike is decisive, stopping short of cruelty.",
      "command_through_respect": "Values loyalty earned through wisdom and fairness rather than fear.",
      "philosopher_queen": "In peace, a thoughtful strategist and clan matriarch; on the battlefield, a controlled storm of tactical brilliance."
    },
    "clan_and_village_relationships": {
      "yotsuki_clan": "As matriarch, Chen has transformed the Yotsuki focus to lightning control, speed, and tactical synergy over brute force, making them a tactical pillar in Kumogakure.",
      "raikage_relationship": "Balances the raw might of the Raikage with her strategic insight, preserving equilibrium in Kumo’s leadership."
    },
    "core_attributes_and_power_profile": {
      "elemental_affinities": {
        "primary": "Lightning Release (Raiton)",
        "secondary": "Wind Release (Fūton)",
        "tertiary": "Water Release (Suiton)",
        "advanced_nature": "Storm Release (Ranton)"
      },
      "specially_noted": "Chen’s Storm Release emphasizes precise electromagnetic manipulation over sheer devastation."
    },
    "raijin_sage_mode": {
      "description": "A unique Sage transformation blending natural energy, lightning, and wind.",
      "capabilities": {
        "electromagnetic_perception": "Detects subtle chakra signals and movements through electric fields, making it hard for enemies to hide.",
        "atmospheric_control": "Can alter local weather, generate storm clouds, and direct lightning toward targets; capable of summoning fierce winds or static-laden rain.",
        "enhanced_reaction_and_defense": "Accelerated reflexes to near-instantaneous speeds for reading attacks, with an ionized air shroud that disrupts direct jutsu.",
        "resource_and_duration_limits": "Sustaining Raijin Sage Mode demands high chakra and focus, taxing Chen if prolonged."
      }
    },
    "signature_jutsu_and_techniques": {
      "judicators_spear": "Fires a precision bolt of charged plasma at extremely high speed, ideal for neutralizing key targets or breaking barriers.",
      "azure_judgment_dome": "Creates a crackling, semi-transparent dome that disrupts enemy chakra flow, disabling lower-ranked opponents or groups.",
      "raijin_lightning_prison": "Encases a target or small group in a relentless cage of plasma arcs, severely punishing brute-force escape attempts.",
      "raijin_verdict": "Concentrates storm energy into a massive lightning strike comparable to a Tailed Beast blow, requiring a short charging period.",
      "skybreaker_emp": "Combines Lightning and Wind release to disrupt technology and ninjutsu seals over a wide area; must be activated precisely to avoid friendly fire."
    },
    "summoning_contract": {
      "description": "Contract with Raijin’s Beasts that enhances battlefield support through summoning",
      "summons": {
        "thunder_kirin": "A massive summon rivaling smaller tailed beasts in raw destructive output, used sparingly due to high chakra cost.",
        "thunder_hawks": "Agile aerial summons adept at strikes and reconnaissance, used more frequently for their lower chakra drain."
      }
    },
    "storm_seals_and_secret_arts": {
      "pact_of_raijin": "A sealing technique that siphons enemy chakra into an ionized storm symbol, effective against rampaging foes.",
      "eye_of_the_storm": "Erects a swirling cyclone with a calm central 'eye'; enemies outside face punishing winds and lightning arcs, though extended use depletes Chen’s chakra."
    },
    "fighting_style_and_combat_philosophy": {
      "battlefield_control": "Prioritizes controlling the battlefield through environmental manipulation and limiting enemy mobility, preferring brief heavy bursts to prolonged combat.",
      "precision_and_minimal_collateral": "Focuses on vital strikes that eliminate key threats while minimizing unintended casualties.",
      "submission_over_prolonged_violence": "Prefers to force enemy surrender through tactical superiority rather than relentless destruction, but will decisively eliminate threats if necessary.",
      "synergy_with_allies": "Works seamlessly with allied squads in pincer attacks or coordinated strategies."
    },
    "relative_power_scaling": {
      "comparative_note": "Chen is among the elite shinobi; her mastery of Storm Release, Sage Mode, and battlefield control enables her to challenge top-tier adversaries.",
      "strengths": "Unrivaled disruption on the battlefield, powerful finishing moves, and enhanced sensory capabilities through electromagnetic perception.",
      "situational_challenges": [
        "Time–Space Jutsu may bypass her storm-based containment.",
        "Closed environments restrict her weather manipulation.",
        "Prolonged battles against multiple top-tier foes can drain her resources."
      ]
    },
    "key_stats_snapshot": {
      "ninjutsu_expertise": "10/10",
      "taijutsu_proficiency": "8/10",
      "genjutsu_resistance": "7.5/10",
      "chakra_reserves": "9/10",
      "speed_and_reaction": "9.5/10",
      "durability_and_endurance": "8/10 (enhanced by Sage Mode but requires conservation)",
      "battlefield_influence": "10/10"
    },
    "final_statement": "Chen Yotsuki embodies Kumogakure’s ideals with her disciplined command over lightning and storms. A calm center in the midst of chaos, she turns battlefields into strategic webs of thunder and wind. With precision and measured strength, she ensures that every strike is both decisive and accountable.",
    "simulation_commands": [
      {
        "command": "Run Chakra Integrity Check",
        "description": "Recalculate and report each combatant's chakra from initialization to the current stage."
      },
      {
        "command": "Show Simulation Layer for Stage X",
        "description": "Display the raw simulation data for the specified stage without narrative embellishments."
      },
      {
        "command": "Verify Technique Legality [Technique Name]",
        "description": "Confirm that the specified technique is supported by the combatant’s profile."
      },
      {
        "command": "Pause Narration, Sim Only",
        "description": "Switch to a mechanical-only reporting mode without anime-style narrative output."
      },
      {
        "command": "Resume Dual-Layer Mode",
        "description": "Resume full simulation and narrative output under the established dual-layer mode."
      },
      {
        "command": "Rollback to Stage X",
        "description": "Reset the simulation to a previous stage and recalculate all states and chakra reserves."
      },
      {
        "command": "Directive Breach – Reset Required",
        "description": "Immediately restart the simulation from Stage 0 with corrected adherence to directives."
      }
    ],
    "battle_start_confirmation": {
      "steps": [
        "Initialize each combatant's chakra based on type (100% for standard shinobi, 165% for Sage Mode users, 200% for Perfect Jinchūriki).",
        "Randomly select a battlefield from the Naruto universe and apply all corresponding environmental effects.",
        "Narrate the immersive Opening Scene with dynamic visuals, character introductions, and dialogue that reflects each combatant’s established persona.",
        "Conclude the scene with the prompt: 'Do you wish to proceed to Stage 1?'"
      ]
    },
    "system_lock_extensions": {
      "auto_epilogue": "Auto-epilogue is enabled; no simulation may conclude without delivering an epilogue.",
      "narrative_output_lock": "Narrative output must strictly reflect only the validated simulation layer with no additional embellishments.",
      "post_victory_lock": "Upon defeat or incapacitation, the simulator must immediately deliver a tactical breakdown and epilogue without user prompts."
    },
    "dual_layer_simulation_mode": {
      "description": "The simulation operates in two layers. The internal simulation layer executes all combat mechanics, chakra tracking, and legality checks. The external narrative layer then presents the final, validated simulation results with immersive, anime-style narration."
    }
  }
  